# import this - Дзен Пайтона

# Пробелы перед и после основных операторов

# Отступы после двоеточий:
# 1. Отступ этот совершается четырьмя нажатиями пробела;
# 2. С помощью нажатия Tab.

# Названия переменных - мы называем переменные таким образом, чтобы позже -
# - по названию понять, что находится внутри переменной.

# Есть два варианта чтобы отформатирован в соответствии со стандартами PEP 8:
# 1. Нужно нажать правой кнопкой мыши на подчеркнутую часть кода и опять-таки щелкнуть -
# - «Reformat the file»;
# 2. Выделить код и нажать Ctrl + Alt + L.

name = input('Enter your name')
x, y = 5, 2
a = 2

if 5 > 1:
    print('ok')
    print('not ok')
    if 1 >= 0:
        print('i`m here')
        print('not ok')
